// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "펌웨어 업데이트";

// Errors
FileOpenError = "파일 %@을(를) 열 수 없음";
FileOpenErrorExplanation = "이 파일은 손상되었거나 다른 위치로 옮겨졌거나 이름이 변경되었거나 삭제되었을 수 있습니다. 파일 위치를 확인하거나 다른 파일을 선택하고 다시 시도하십시오.";
PrintChannelOpenError = "프린터 채널을 열 수 없음";
PrintChannelOpenErrorExplanation = "프린터의 연결 및 전원 상태를 확인한 뒤 다시 시도하십시오.";
SendDataError = "데이터를 프린터로 전송할 수 없음";
SendDataErrorExplanation = "프린터의 연결 및 전원 상태를 확인한 뒤 다시 시도하십시오.";

SomePenErrorTitle = "펌웨어를 업데이트할 수 없음";
DoorOpenMsg = "덮개가 열려 있어 펌웨어를 업데이트할 수 없습니다. 모든 덮개를 닫으십시오.";

// Aquamarine Errors
FileCheckError = "펌웨어를 업데이트할 수 없음";
FileCheckErrorExplanation = "펌웨어 패키지가 유효하지 않습니다. 다른 파일을 선택하고 다시 시도하십시오.";

OkButton = "확인";
CancelButton = "취소";
FirmwareUpdateTitle = "펌웨어 업데이트";
FirmwareUpdateDeviceState = "인쇄 중";
FirmwareUpdateCancelingDeviceState = "취소 중";

// Great Wall Messages
PrinterIdleWarning = "프린터를 사용중일 경우 펌웨어 업데이트가 안 될 수 있습니다(예를 들어 작업 인쇄 또는 보정 중일 경우).\n\n펌웨어 업데이트 절차를 계속하기 전에 프린터가 대기 중인지 확인하십시오.";
UpdateSuccessful = "펌웨어 파일이 성공적으로 업로드되었으며 프린터를 업데이트할 준비가 되었습니다.\n\n펌웨어 업데이트가 완료되면 프린터가 자동으로 재부팅됩니다.";
InvalidPackage = "펌웨어 파일에 문제가 있어서 펌웨어 업데이트 절차가 성공적으로 실행되지 않았습니다. 해당 문제는 전송 오류로 인한 것일 수 있습니다.\n\n펌웨어 업데이트 절차를 다시 시도하십시오.\n문제가 지속되면 HP 지원에 문의하십시오.";
FailedDependencies = "펌웨어 업데이트 절차가 종속성 문제로 인해 성공적으로 실행되지 않았을 가능성이 있습니다.\n\n현재 펌웨어 버전은 %@이며 %@을(를) 설치하려고 합니다.\n\n다음 웹 페이지를 방문하여 해당 프린터에 적합한 업데이트 패키지를 검색하십시오:\n%@.";
NotNow = "프린터를 사용 중이기 때문에 펌웨어 업데이트가 성공적으로 실행되지 않았습니다.\n\n프린터가 대기 중인지 확인하고 펌웨어 업데이트를 다시 실행하십시오.";
TransmissionError = "펌웨어 업데이트가 성공적으로 실행되지 못하도록 하는 전송상의 문제가 있었습니다.\n\n프린터의 연결을 확인하고 펌웨어 업데이트를 다시 실행하십시오.";
LicenseNotAccepted = "사용권이 수락되지 않아서 펌웨어 업데이트가 실행되지 않았습니다.";
FatalError = "펌웨어 업데이트 절차가 성공적으로 이루어지지 못하도록 하는 문제가 있었습니다.\n\n문제가 지속되면 HP 지원에 문의하십시오.";

// layout
TaskTitle = "펌웨어 업데이트";
TaskDescription = "펌웨어가 포함된 파일을 선택한 다음 프린터로 전송하여 업데이트하십시오.";
FileNameTitle = "파일명:";
FileNameField = "<선택되지 않았음>";
ChooseButton = "선택…";
UpdateButton = "업데이트";
ProgressPanel = "진행률 업데이트";
FirmwareUpdateProcessTitle = "업데이트하는 중…";
